import fs from 'fs'; const pkg = JSON.parse(fs.readFileSync('./package.json', 'utf-8'));

export function menu(prefix, nomebot, sender) {
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🌸 𝗠𝗘𝗡𝗨 - ${nomebot} 🌸
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────

🌟 𝗠𝗘𝗡𝗨𝗦 𝗗𝗜𝗩𝗘𝗥𝗦𝗢𝗦 🌟

¤ » ${prefix}Menudono
¤ » ${prefix}Menuadm
¤ » ${prefix}Menuzueira
¤ » ${prefix}menulogo
¤ » ${prefix}menuefeito

────────────────────────

⚙️ 𝗖𝗢𝗡𝗙𝗜𝗚𝗨𝗥𝗔𝗖𝗢𝗘𝗦 ⚙

¤ » ${prefix}Info (cmd)
¤ » ${prefix}Configbot (bot)

────────────────────────

👑 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗔𝗗𝗠𝗜𝗡 👑

¤ » ${prefix}Ver (visual)
¤ » ${prefix}Ban (@)
¤ » ${prefix}Grupo (a/f)
¤ » ${prefix}Sorteio (?)
¤ » ${prefix}Configp (grupo)

────────────────────────

🙋 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗨𝗦𝗨𝗔𝗥𝗜𝗢

¤ » ${prefix}Tabela
¤ » ${prefix}donos
¤ » ${prefix}idmeu (id)
¤ » ${prefix}Ping (bot)
¤ » ${prefix}calcular (1+1)
¤ » ${prefix}Conselhos *
¤ » ${prefix}Me (info)
¤ » ${prefix}Ddd (ex: 98)
¤ » ${prefix}Perfil (usua)
¤ » ${prefix}Dono (bot)
¤ » ${prefix}Nick (txt)
¤ » ${prefix}Conselhobiblico *
¤ » ${prefix}Checkativo (@)
¤ » ${prefix}Traduzir (pt/txt)
¤ » ${prefix}Gerarlink (img/vid) 
¤ » ${prefix}Encurtalink (link)
¤ » ${prefix}tomp3 (video)
¤ » ${prefix}legenda (text/text)

────────────────────────

🎵 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗗𝗢𝗪𝗡𝗟𝗢𝗔𝗗

¤ » ${prefix}Play (Nome)
¤ » ${prefix}Play2 (Nome)
¤ » ${prefix}Playdoc (Nome)
¤ » ${prefix}Playvid (Nome)
¤ » ${prefix}Shazam (@Áudio)
¤ » ${prefix}memes (Nome)
¤ » ${prefix}tiktokvideo (Link)
¤ » ${prefix}Tiktokaudio (Link)
¤ » ${prefix}Instagram (Link)
¤ » ${prefix}Instaaudio (Link)
¤ » ${prefix}Kwai (Link)
¤ » ${prefix}Pinterestv (Link)
¤ » ${prefix}Faceaudio (Link)
¤ » ${prefix}Facevideo (Link)

────────────────────────

🖼️ 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗦𝗧𝗜𝗖𝗞𝗘𝗥

¤ » ${prefix}S (ing/vid)
¤ » ${prefix}Attp (txt)
¤ » ${prefix}Qc (txt)
¤ » ${prefix}loli (txt) 
¤ » ${prefix}Toimg (stick)
¤ » ${prefix}Togif (stick)
¤ » ${prefix}Metadinha
¤ » ${prefix}Id (figurinha) 
¤ » ${prefix}Rfundo (img) 
¤ » ${prefix}Roubar (fig)
¤ » ${prefix}Emojimix (☺️+🤡) 

────────────────────────

🔍 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗣𝗘𝗦𝗤𝗨𝗜𝗦𝗔

¤ » ${prefix}G1 (notícia)
¤ » ${prefix}Grupos (zap)
¤ » ${prefix}Frases (tema)
¤ » ${prefix}Clima (cdd)
¤ » ${prefix}Movie (Nome)
¤ » ${prefix}Serie (Nome)
¤ » ${prefix}Pinterest (Nome)
¤ » ${prefix}Wallpaper (Nome)
¤ » ${prefix}Receita (Nome)
¤ » ${prefix}Signo (Nome)
¤ » ${prefix}Celular (Nome)
¤ » ${prefix}Ytsearch (Nome)
¤ » ${prefix}Lyrics (Nome)
¤ » ${prefix}Playstore (Nome)
¤ » ${prefix}Amazon (Nome)
¤ » ${prefix}Google (Nome)
¤ » ${prefix}Noticias (Tema)
¤ » ${prefix}Nasa (19-10-2007)
¤ » ${prefix}Prox_jogos (Time)
¤ » ${prefix}meunome (nome)

────────────────────────

🤖 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗜𝗔/𝗚𝗣𝗧

¤ » ${prefix}Gpt (Pergunta)
¤ » ${prefix}Aiimage (ideia?)
¤ » ${prefix}Totext (@Áudio) 
¤ » ${prefix}Ai-photo (Ideia)
¤ » ${prefix}Gtts (ola amigo)

────────────────────────`;
};
  

// adminstradores

export function menuadm(prefix, nomebot, sender) {
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🌟 𝗠𝗘𝗡𝗨 𝗔𝗗𝗠 - ${nomebot} 🌟
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────

👑 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 𝗔𝗗𝗠𝗜𝗡

¤ » ${prefix}Ban (@)
¤ » ${prefix}Ver (media)
¤ » ${prefix}Status (grupo)
¤ » ${prefix}Regras (grupo)
¤ » ${prefix}Delete (mensagem)
¤ » ${prefix}Limpar (grupo)
¤ » ${prefix}Linkgp (grupo)
¤ » ${prefix}Grupo (a/f)
¤ » ${prefix}Promover (@)
¤ » ${prefix}Rebaixar (@)

────────────────────────

🙋 𝗠𝗔𝗥𝗖𝗔𝗥 𝗠𝗘𝗠𝗕𝗥𝗢

¤ » ${prefix}Cita (mensagem)
¤ » ${prefix}Marcar (mensagem)

────────────────────────

📊 𝗥𝗔𝗡𝗞 𝗨𝗦𝗨𝗔𝗥𝗜𝗢

¤ » ${prefix}Rankativo (grupo)
¤ » ${prefix}Rankinativo (grupo)
¤ » ${prefix}Atividade (grupo)
¤ » ${prefix}Inativos (ex: 2)
¤ » ${prefix}Zerarank (grupo)
¤ » ${prefix}Checkativo (@)

────────────────────────

🚫 𝗟𝗜𝗦𝗧𝗔 𝗡𝗘𝗚𝗥𝗔

¤ » ${prefix}Listaban
¤ » ${prefix}Listanegra (+55)
¤ » ${prefix}Tirardalista (+55)

────────────────────────

⚙️ 𝗔𝗟𝗧𝗘𝗥𝗔𝗥 𝗚𝗥𝗨𝗣𝗢

¤ » ${prefix}Nomegp *
¤ » ${prefix}Descgp *
¤ » ${prefix}Prefixgp

────────────────────────

🔒 𝗕𝗟𝗢𝗖𝗞 𝗖𝗠𝗗𝗦

¤ » ${prefix}Blockcmd (cmd) 
¤ » ${prefix}Desblocmd (cmd) 

────────────────────────

🤐 𝗠𝗨𝗧𝗘 𝗠𝗘𝗠𝗕𝗥𝗢𝗦

¤ » ${prefix}Mute (@)
¤ » ${prefix}Desmute (@)

────────────────────────

⚙️ 𝗟𝗜𝗠𝗜𝗧𝗘/𝗖𝗔𝗥𝗔𝗖𝗧𝗘𝗥𝗘𝗦

¤ » ${prefix}addlimite (ex 500)
¤ » ${prefix}dellimite (ex 500)

────────────────────────

📢 𝗔𝗡𝗧𝗜 𝗣𝗔𝗟𝗔𝗩𝗥𝗔𝗢

¤ » ${prefix}addpalavrao (text)
¤ » ${prefix}delpalavrao (text)
¤ » ${prefix}listarpalavrao
¤ » ${prefix}zerapalavrao (tudo)

────────────────────────`;
};

// comandos de donos

export function menudono(prefix, nomebot, sender) {
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🌟 𝗠𝗘𝗡𝗨 𝗗𝗢𝗡𝗢 - ${nomebot} 🌟
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────

👑 𝗖𝗠𝗗𝗦 𝗗𝗢𝗡𝗢𝗦 

¤ » ${prefix}Listagp (grp)
¤ » ${prefix}sairgp (n⁰)
¤ » ${prefix}sair (n⁰)
¤ » ${prefix}Idgp (grp)
¤ » ${prefix}Lyna (on/off) 
¤ » ${prefix}entrar (link)

────────────────────────

🛡️ 𝗖𝗠𝗗𝗦 𝗔𝗡𝗧𝗜𝗦 𝗔𝗣𝗜

¤ » ${prefix}Antipv
¤ » ${prefix}Antipv2 
¤ » ${prefix}Chekey 
¤ » ${prefix}Addkey (key)

────────────────────────

📋 𝗢𝗨𝗧𝗥𝗢𝗦 𝗖𝗠𝗗𝗦

¤ » ${prefix}Seradm
¤ » ${prefix}Sermembro
¤ » ${prefix}Ativo
¤ » ${prefix}modoff (msg)
¤ » ${prefix}Visualizarmsg

────────────────────────

🔐 𝗕𝗟𝗢𝗤𝗨𝗘𝗜𝗢𝗦 

¤ » ${prefix}Blockmemb [@]
¤ » ${prefix}Dblockmemb [@]
¤ » ${prefix}listacmd
¤ » ${prefix}Blockcmd (cmd)
¤ » ${prefix}Dblockcmd (cmd)


¤ » ${prefix}Listatm
¤ » ${prefix}ListanegraG (+55)
¤ » ${prefix}TirardalistaG (+55)

────────────────────────

👑 𝗗𝗢𝗡𝗢𝗦

¤ » ${prefix}Donos
¤ » ${prefix}Dono1 (@)
¤ » ${prefix}Dono2 (@)
¤ » ${prefix}Dono3 (@)

────────────────────────

📈 𝗡𝗜́𝗩𝗘𝗟 / 𝗟𝗘𝗩𝗘𝗟

¤ » ${prefix}Addlevel (quantidade)
¤ » ${prefix}Tirarlevel (quantidade)
¤ » ${prefix}Addxp (quantidade)
¤ » ${prefix}Tirarxp (quantidade)
¤ » ${prefix}Rmlevel (@marcar)

────────────────────────`;
};

// brincadeiras

export function menuzuira(prefix, nomebot, sender) {
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🌟  𝙈𝙀𝙉𝙐 𝙁𝙐𝙉 // 𝙅𝙊𝙂𝙊𝙎 - ${nomebot} 🌟
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────
🕹 𝗝𝗢𝗚𝗢𝗦

¤ » ${prefix}jogodavelha (@)
¤ » ${prefix}resetvelha (admins)
¤ » ${prefix}cassino (😊)
¤ » ${prefix}Ppt (Pedra/Papel/Tesoura) 
¤ » ${prefix}Dados (número 1 ate 6)

────────────────────────

💥 𝗙𝗨𝗡/𝗧𝗥𝗢𝗟𝗟

¤ » ${prefix}Matar (marca@)
¤ » ${prefix}Casal (casal)
¤ » ${prefix}Beijo (marca@)

────────────────────────

❓ 𝗣𝗘𝗥𝗚𝗨𝗡𝗧𝗔𝗦

¤ » ${prefix}Chance (doque?)
¤ » ${prefix}Quando (perguntar)
¤ » ${prefix}Vab (Você prefere hm?)
¤ » ${prefix}Eununca (Eu nunca, eu já?)

────────────────────────

📸 𝗣𝗢𝗦𝗘𝗡𝗧𝗔𝗚𝗘𝗠

¤ » ${prefix}Dogolpe (marca@)
¤ » ${prefix}Nazista (marca@)
¤ » ${prefix}Gay (marca@)
¤ » ${prefix}Sorte (marca@)
¤ » ${prefix}Feio (marca@)
¤ » ${prefix}Corno (marca@)
¤ » ${prefix}Vesgo (marca@)
¤ » ${prefix}Bebado (marca@)
¤ » ${prefix}Gostoso (marca@)
¤ » ${prefix}Gostosa (marca@)

────────────────────────

📊 𝗥𝗔𝗡𝗞𝗜𝗡𝗚𝗦 𝗙𝗨𝗡

¤ » ${prefix}Rankgay (5)
¤ » ${prefix}Rankcorno (5)
¤ » ${prefix}Rankgostoso (5)
¤ » ${prefix}Rankgostosa (5)
¤ » ${prefix}Ranknazista (5)
¤ » ${prefix}Rankbct (5)
¤ » ${prefix}Rankpau (5)
¤ » ${prefix}rankfeio (5)

────────────────────────`;
};

// menu logos

export function menulogos(prefix, nomebot, sender) { return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🎨 𝗠𝗘𝗡𝗨 𝗟𝗢𝗚𝗢𝗦 - ${nomebot} 🎨
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────

🖌️ 𝗟𝗢𝗚𝗢𝗦 𝗖𝗢𝗠 2 𝗧𝗘𝗫𝗧𝗢𝗦

¤ » ${prefix}captain (txt1/txt2)
¤ » ${prefix}graffitiwall (txt1/txt2)
¤ » ${prefix}phlogo (txt1/txt2)
¤ » ${prefix}blackpink (txt1/txt2)
¤ » ${prefix}deadpool (txt1/txt2)
¤ » ${prefix}glitter (txt1/txt2)
¤ » ${prefix}vintage3d (txt1/txt2)

────────────────────────

🖌️ 𝗟𝗢𝗚𝗢𝗦 𝗖𝗢𝗠 1 𝗧𝗘𝗫𝗧𝗢

¤ » ${prefix}galaxy-light (txt)
¤ » ${prefix}galaxy (txt)
¤ » ${prefix}glitch (txt)
¤ » ${prefix}graffiti (txt)
¤ » ${prefix}metallic (txt)
¤ » ${prefix}glossy (txt)
¤ » ${prefix}mascote (txt)
¤ » ${prefix}dragonfire (txt)
¤ » ${prefix}goldpink (txt)
¤ » ${prefix}pubgavatar (txt)
¤ » ${prefix}ffavatar (txt)
¤ » ${prefix}amongus (txt)
¤ » ${prefix}comics (txt)
¤ » ${prefix}lolavatar (txt)
¤ » ${prefix}cemiterio (txt)
¤ » ${prefix}blood (txt)
¤ » ${prefix}hallobat (txt)
¤ » ${prefix}titanium (txt)
¤ » ${prefix}eraser (txt)
¤ » ${prefix}halloween (txt)
¤ » ${prefix}snow (txt)
¤ » ${prefix}america (txt)
¤ » ${prefix}mascoteneon (txt)
¤ » ${prefix}doubleexposure (txt)
¤ » ${prefix}metal (txt)
¤ » ${prefix}3dcrack (txt)
¤ » ${prefix}colorful (txt)
¤ » ${prefix}ballon (txt)
¤ » ${prefix}multicolor (txt)
¤ » ${prefix}graffitipaint (txt)
¤ » ${prefix}graffitistyle (txt)
¤ » ${prefix}frozen (txt)
¤ » ${prefix}ligatures (txt)
¤ » ${prefix}watercolor (txt)
¤ » ${prefix}summerbeach (txt)
¤ » ${prefix}cloudsky (txt)
¤ » ${prefix}techstyle (txt)
¤ » ${prefix}royal (txt)
¤ » ${prefix}firework (txt)
¤ » ${prefix}mascotemetal (txt)
¤ » ${prefix}fluffy-logo (txt)
¤ » ${prefix}lava-logo (txt)
¤ » ${prefix}cool-logo (txt)
¤ » ${prefix}comic-logo (txt)
¤ » ${prefix}fire-logo (txt)
¤ » ${prefix}water-logo (txt)
¤ » ${prefix}ice-logo (txt)
¤ » ${prefix}elegant-logo (txt)
¤ » ${prefix}gold-logo (txt)
¤ » ${prefix}fortune-logo (txt)
¤ » ${prefix}blue-logo (txt)
¤ » ${prefix}silver-logo (txt)
¤ » ${prefix}neon-logo (txt)
¤ » ${prefix}skate-name (txt)
¤ » ${prefix}retro-logo (txt)
¤ » ${prefix}candy-logo (txt)
¤ » ${prefix}glossy-logo (txt)

────────────────────────`;
};

export function menuefeitos(prefix, nomebot, sender) { 
return `​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​
🧩 𝗘𝗙𝗘𝗜𝗧𝗢𝗦 𝗔𝗟𝗧𝗘𝗥𝗔𝗗𝗢𝗥𝗘𝗦 - ${nomebot} 🧩
Versão: ${pkg.version} | Prefixo: ${prefix}
By: @${sender.split("@")[0]}

────────────────────────

🎧 𝗔𝗟𝗧𝗘𝗥𝗔𝗥 𝗔𝗨𝗗𝗜𝗢

¤ » ${prefix}esquilo (audio)
¤ » ${prefix}audiolento (audio)
¤ » ${prefix}audiorapido (audio)
¤ » ${prefix}estourar (audio)
¤ » ${prefix}bass (audio)
¤ » ${prefix}bass2 (audio)
¤ » ${prefix}vozmenino (audio)
¤ » ${prefix}grave (audio)

────────────────────────

🎬 𝗔𝗟𝗧𝗘𝗥𝗔𝗥 𝗩𝗜𝗗𝗘𝗢

¤ » ${prefix}videorapido (video)
¤ » ${prefix}videolento (video)
¤ » ${prefix}videocontrario (video)

────────────────────────

🎭 𝗘𝗙𝗘𝗜𝗧𝗢𝗦 𝗗𝗘 𝗜𝗠𝗔𝗚𝗘𝗠

¤ » ${prefix}comunismo (Img)
¤ » ${prefix}bolsonaro (Img)
¤ » ${prefix}affect (Img)
¤ » ${prefix}beautiful (Img)
¤ » ${prefix}del (Img)
¤ » ${prefix}hither (Img)
¤ » ${prefix}facepalm (Img)
¤ » ${prefix}magik (Img)
¤ » ${prefix}rip (Img)
¤ » ${prefix}jail (Img)
¤ » ${prefix}trash (Img)
¤ » ${prefix}sepia (Img)
¤ » ${prefix}wanted (Img)
¤ » ${prefix}wasted (Img)
¤ » ${prefix}lgbt (Img)
¤ » ${prefix}karaba (Img)
¤ » ${prefix}bnw (Img)
¤ » ${prefix}blur (Img)
¤ » ${prefix}circle (Img)
¤ » ${prefix}invert (Img)
¤ » ${prefix}pixelate (Img)
¤ » ${prefix}rotate (Img)
¤ » ${prefix}toanime (Img)
¤ » ${prefix}tozombie (Img)
¤ » ${prefix}togta (Img)

────────────────────────`;
};